<template>
  <div>
    <!-- ========== MAIN ========== -->
    <main id="content" role="main">

<!--      <homepage-hero :heroTitle="heroTitle" :heroSubTitle="heroSubTitle"></homepage-hero>-->
      <div style="width: auto;height: 100px"></div>

      <!-- Terms Content Section -->
      <div class="container space-2 space-bottom-lg-1">
        <div class="row">
          <div
            id="stickyBlockStartPoint"
            class="col-md-4 col-lg-3 mb-7 mb-md-0"
          >
            <!-- Nav -->
            <div :class="{'is_fixed' : isFixed}" style="width: 230px">
            <nav
              class="js-sticky-block card card-bordered"
              data-hs-sticky-block-options='{
                 "parentSelector": "#stickyBlockStartPoint",
                 "targetSelector": "#logoAndNav",
                 "breakpoint": "md",
                 "startPoint": "#stickyBlockStartPoint",
                 "endPoint": "#stickyBlockEndPoint",
                 "stickyOffsetTop": 24,
                 "stickyOffsetBottom": 24
               }'
            >
              <div class="card-body" >
                <ul class="js-scroll-nav nav nav-sm nav-x-0 flex-column">
                  <li class="nav-item">
                    <a class="nav-link font-weight-bold mb-2" href="/bylaws/#ch1"
                    >第一章 总则</a
                    >
                  </li>
                  <li class="nav-item">
                    <a class="nav-link font-weight-bold mb-2" href="/bylaws/#ch2"
                    >第二章 目的及活动内容</a
                    >
                  </li>
                  <li class="nav-item">
                    <a
                      class="nav-link font-weight-bold mb-2"
                      href="/bylaws/#ch3"
                    >第三章 会员</a
                    >
                  </li>
                  <li class="nav-item">
                    <a
                      class="nav-link font-weight-bold mb-2"
                      href="/bylaws/#ch4"
                    >第四章 组织和干部</a
                    >
                  </li>
                </ul>
              </div>
            </nav>
              </div>
            <!-- End Nav -->
            <div style="height: 80px"></div>
            <div id="boxFixed"></div>
          </div>
<!--&lt;!&ndash;条款内容&ndash;&gt;-->
<!--          <h2 id="ch1">第一章 总则</h2>-->
<!--          <br />-->
<!--          <h4>第 1 条(名称及地址)</h4>-->
<!--          <p>(1) 本会的名称为世界华人华侨人机交互协会(英文名 International Chinese Association of Computer Human Interaction,简称「ICACHI」)。URL 为 http://www.icachi.org/</p>-->
<!--          <p>(2)本会的总部设在加拿大。协会地址：849 Laurelwood Dr, Waterloo, ON N2V 2X6, Canada</p>-->
<!--          <p>电话: +852 2766-7279, +81-887-57-2209</p>-->
<!--          <p>传真: +852 2774-0842, +81-887-57-2209</p>-->
<!--          <p>协会网址: www.icachi.org</p>-->
<!--          <p>秘书处: office&commat;icachi.org</p>-->
<!--          <p>(3)本会在世界其他各地设协会的办事处。目前协会在北京和多伦多分别设有办事处。</p>-->
<!--          <br>-->
<!--          <h2 id="ch2">第二章 目的及活动内容</h2>-->
<!--          <br />-->
<!--          <h4>第 2 条(目的)</h4>-->
<!--          <p>本会的目的如下:</p >-->
<!--          <p>(1)促进世界华人华侨人机交互学生学者间,以及本会会员和其他人机交互国际组 织和学者的学术交流和合作研究。</p >-->
<!--          <p>(2)促进亚洲特别是华语地区的人机交互发展, 学术交流和合作。促进具有地域文 化的人机交互的发展和交流。</p >-->
<!--          <p>(3)通过各种学术交流等活动,提高会员的学术水平及社会地位。</p >-->
<!--          <p>(4)承担起多国(包括地区,以下同样)间的文化,学术和经济交流的桥梁作用。</p >-->
<!--          <p>(5)对人类的科学进歩和技术发展,以及学者所在国和全人类的社会,经济,科学, 技术发展等做出贡献。</p >-->
<!--          <h4 id="ch3">第 3 条(活动内容)</h4>-->
<!--          <p>本会为达到上述目的,开展以下活动。</p >-->
<!--          <p>(1)利用计算机网络开展研究讨论会。</p >-->
<!--          <p> (2)促进亚洲特别是华语地区的人机交互发展, 学术交流和合作。促进具有地域文 化的人机交互的发展和交流。</p >-->
<!--          <p>(3)通过各种学术交流等活动,提高会员的学术水平及社会地位。</p >-->
<!--          <p>(4)承担起多国(包括地区,以下同样)间的文化,学术和经济交流的桥梁作用。</p >-->
<!--          <p>(5)对人类的科学进歩和技术发展,以及学者所在国和全人类的社会,经济,科学, 技术发展等做出贡献。</p >-->
<!--          <p>(6)对会员所在国的科学技术政策献计献策,协助高新科学技术的开发。</p >-->
<!--          <p>(7)其他,为达到本会目的所需的相关活动。</p >-->
<!--          <br />-->
<!--          <h2>第三章 会员</h2>-->
<!--          <br />-->
<!--          <h4>第 4 条(会员的种类)</h4>-->
<!--          <p>本会设有以下会员,入会条件如以下各条所示：</p >-->
<!--          <p>(1)正会员，赞同本会宗旨或在教育部门,研究机构,民间公司等工作,从事 HCI 学术研究及 技术开发者。缴纳会费者。享有协会的各种选举权和被选举权。协会各种活动的优先 参加权。</p >-->
<!--          <p>(2)学生会员，在校在读的全职学生。缴纳会费者。协会各种活动的优先参加权。</p >-->
<!--          <p>(3)一般会员，年满 18 岁赞同本会宗旨或从事有关 HCI 工作者。</p >-->
<!--          <p>(4)名誉会员，对 HCI 领域或对本会做出突出贡献者,经会长提名,经 3 分之 2 以上理事会成员 的赞成通过后可被聘为本会名誉会员。名誉会员为终身制。不需缴纳会费。</p >-->
<!--          <h4>第 5 条(会员的义务及权利)</h4>-->
<!--          <p>(1)赞同本会的目的,遵守本規则,积极参加本会的活动。</p >-->
<!--          <p>(2)会员要维护协会的团结,协会的信誉,严以律己不作不利于或有损于协会名誉 的言行。</p >-->
<!--          <p>(3)正会员和缴纳会费的学生会员有表决投票权和被选举权。名誉会员无表决投票 权和被选举权。</p >-->
<!--          <p>(3)一般会员，年满 18 岁赞同本会宗旨或从事有关 HCI 工作者。</p >-->
<!--          <p>(4)正会员和缴纳会费的学生会员协会享有协会各种活动的优先参加权。</p >-->
<!--          <h4>第 6 条(入会)</h4>-->
<!--          <p>(1)办理入会手续的受理部门为秘书处 (office@icahci.org)。</p >-->
<!--          <p>(2)希望入会者必须由本人亲自申请。</p >-->
<!--          <p>(3)希望入会者应填写和提交规定的申请表格以及相关的证明书类,接受理事会审 查通过并交纳会费者。</p >-->
<!--          <p>(4)办理完入会手续后,发给申请者会员号码,即可成为本会会员。</p >-->
<!--          <p>(5)学生会员取得学位后,可以转为正会员。但届时必须履行会员种类变更手续。</p >-->
<!--          <h4>第7条(会费)</h4>-->
<!--          <p>(1)会费如下表所示。名誉会员:免除会费。学生会员在转为正会员时,不另收会费。经理事会讨论后入会费可以变更。</p >-->
<!--          <img src="https://s3.bmp.ovh/imgs/2022/03/bb95c8cf84513f36.webp">-->
<!--          <p>(2)已经交纳的会费,不管有任何理由均不退还。</p >-->
<!--          <h4>第 8 条(退会)</h4>-->
<!--          <p>(1)会员应向秘书处提出规定的退会申请,办理退会手续后,方可退会。</p >-->
<!--          <p>(2)对于 3 年以上无法取得联系的会员,被视为自动退会,但经本人申请后可以恢 复其会员资格。</p ><p>(3)会员死亡或已被宣布失踪的请况下被视为退会。</p ><h4>第 9 条(惩罚)</h4><p>(1)会员出现以下各条的其中一条时，经理事会 3 分之 2 的成员同意，可以实施包 括暂时停止其会员資格在内的相应处分。</p ><p>・违反本会会规,不遵守或不履行会员义务时。</p ><p>・违反本会会规,不遵守或不履行会员义务时。</p ><p>・有违反社会理念以及社会公德等言行时。</p ><p>・有违反会员所在国或现地国的法律的行为时。</p ><p>(2)根据前项规定处分会员时，要将理事会所作的处分决定通知该会员。另外，给予被处分会员辩解机会。如果本人提出申请,可在理事会决定处分一周前进行书面辩解。</p ><p>(3)处分会员时,作出决定后应向本会会员公布。</p >-->
<!--          <br />-->
<!--          <h2 id="ch4">第四章 组织和干部</h2><br />-->
<!--          <h4>第 10 条(组织)</h4><p>(1)本会由理事会,秘书处,专门委员会,监事构成。</p ><p>(2)理事会是本会的最高决定机构。</p ><p>(3)理事会的下面设有秘书处。</p ><p>(4)理事会的下面设有专门委员会</p ><p>(5)根据协会发展需要,经理事会通过,可设常务理事会或扩大理事会。常务理事 会由会长,常务副会长,副会长和秘书长组成。扩大理事会成员由会长提名理事会通过。</p >-->
<!--          <h4>第 11 条(干部)</h4><p>(1)本会设有名誉会长若干名。</p ><p>(2)本会设有理事 15 名(包括 3 名以内的学生理事),其中会长 1 名和常委副会长 1 名,由理事选出,副会长若干名,由会长提名理事会通过,监事 3 名(其中监事长 1 名 )。</p ><p>(3)本会秘书处,设有秘书长 1 名,副秘书长若干名,会计和出纳各 1 名。</p >-->
<!--          <h4>第 12 条(干部的选任)</h4><p>(1)理事及监事都是通过直接选举从全体会员中选出。</p ><p>(2)正会员或学生会员可以自愿表明成为选举候选人、理事或者监事的竞选。但是 不能同时立为理事和监事的候选人。</p ><p>(3)在选举期间,候选人应该向会员说明当选后的抱负和施政方针并回答会员提出 的质询。向会员说明当选后的抱负和施政方针并回答会员提出的质询。</p ><p>(4)理事会选举结束 15 天以内选出会长和常务副会长。当选的理事有权参加会长 和常务副会长的竞选,会长和常务副会长需要联名立候补(自荐或他荐)参加竞选, 根据理事会的投票结果,过半数者当选。如果第一次投票都没有出现过半数者,依据 淘汰得票少者原则再次进行投票,直到选出为止。如果理事会的人数为偶数,而且最 后的两对会长和常务副会长候选人得票数相等时,根据当选理事时的合计得票数, 以及会长和常务副会长候选人在当选理事时的得票数, 立候选的时间顺序来判定当选者。理事不得弃权,但是可以委托其他理事代为投票。</p ><p>(5)会长可以从理事中指定副会长,秘书长,副秘书长以及会计等人选,通过理事 会的决议后予以委任。</p ><p>(6)监事长是通过监事之间的互选来决定,之后必须通过理事会的审议予以认可。</p ><p>(7)如果会长、理事及监事发生缺额,在发生空缺 30 天以内通过理事会的决议由 理事选举时落选者中得票多者按序当选,或设立补缺选举投票管理委员会,来进行补缺选举。</p >-->
<!--          <h4>第 13 条(干部的任期及限制)</h4><p>(1)会长的任期为 2 年,通过再选举可以连任。但是任期不能连续超过两届。</p ><p>(2)理事的任期为 2 年,通过再选举可以连任。</p ><p>(3)监事的任期为 2 年,通过再选举可以连任。</p ><p>(4)通过补缺选举产生的干部,任期为前任的剩余任期。</p >-->
<!--          <h4>第 14 条(干部的辞任与解任)</h4><p>(1)会长，(常务)副会长,理事以及监事无法履行职务时可以辞职。</p ><p>(2)会长，(常务)副会长,理事即使在任期中,若理事会中有三分之二的理事表 示不信任时, 或会员总会通过不信任决议时明确表态的会员超过半数,并且同时超 过了理事当选得票数时,则必须辞职。</p ><p>(3)监事即使在任期中,如果不履行职务,或会员总会中有三分之二的人投不信任 票时,通过理事会的决议可以解任。</p ><p>(4)理事在任期间必须忠实地履行自己的职责。无故不参加(常务)理事会的会议, 一年中弃权的次数超过五次时,按自动放弃职责对待,通过理事会的决议可以解任。 但是,可以利用委任状委托其他的理事,但一年不能超过三次(每次应在一个月以内)。 监事可以根据计数情况向当事人发出警告。</p >-->
<!--          <h4>第 15 条(理事会)</h4><p>(1)本会由理事会和常务理事会来进行运营。</p ><p>(2)理事会由会长、常务副会长、副会长以及理事组成,会长亦为议长。</p ><p>(3)理事会原则上是通过电子邮件来讨论和作决定,根据需要必要时可以召开 (Skype 等语音或视屏)理事会。</p ><p>(4)理事会的决议是通过议长,或议长委托他人来提议召开,经过充分讨论只要赞 成者超过有权者的半数,议题就可以通过。</p ><p>(5)理事会必须对每年一度的会计报告和监察报告作出审议,在做出决议后向会员 公布。</p ><p>(6)必要时,会长可以召开常务理事会和扩大理事会。</p >-->
<!--          <h4>第 16 条(组织和干部的职务)</h4><p>(1)理事,作为会员的代表参加理事会,遵从本会规章,履行本会赋予的职责。</p ><p>(2)会长,作为本会代表,根据本会规章及理事会做出的决议总体负责本会的工作。</p ><p>(3)常务副会长辅助会长工作。如果会长辞职,或者,无法履行职责时,通过理事 会的表决,由常务副会长代理会长的职务。</p ><p>(4)副会长,拥有对外的代表权。但基本负责担任本协会主要部门的工作。</p ><p>(5)秘书处,全面负责协会运营方面的工作。</p ><p>(6)会计,根据由理事会决定的财务管理内部守则的规定,负责收缴会费,捐赠收入, 支出等的管理。会计必须在年度或理事会选举开始前,接受监事的监查并向会员提交 会计报告书。</p ><p>(7)监事,对本协会的业务及财产方面,履行以下规定的职责。</p ><p>•监查本会的财产状况,向会员提交财务管理监查报告书及会员名单管理</p ><p>•协会服务器 管理监查报告书。</p ><p>•监查理事的业务执行情况,向会员提交理事会运营监查报告书。</p ><p>•监查选举管理委员会的业务执行情况,向会员提交监查报告书。</p ><p>•公布任期内表决的次数。</p ><p>•当发现在财产状况或者业务执行方面,有不正当的事实时,应向理事会做出报告。</p ><p>•做上述报告时,如有需要,可招开理事会。</p ><p>(8)监事可以出席理事会,并陈述意见。但不拥有表决权。</p ><p>(9)当理事会认为有必要时,则设置专业委员会。其根据理事会的决定,负责政策 的筹划和实施。专业委员会的负责人由理事会决定。</p >-->
<!--          <h4>第 17 条(名誉干部、名誉顾问的委任)</h4><p>(1)本协会根据需要,可以委任名誉干部、名誉顾问。名誉干部(名誉会长,名誉理 事等)、名誉顾问可以对本会的运营和规划出谋划策。</p ><p>(2)名誉干部、名誉顾问应是社会上知名的有学识者,或有影响力的人。确认本人的 意志后,通过理事会推荐,经投票选出。名誉干部、名誉顾问的当选,需要有 3 分之 2 以上理事会成员的赞成。</p ><p>(3)名誉干部、名誉顾问等原则上是终身制。不需缴纳会费。</p >-->
<!--          <h4>第 18 条(奖项)</h4><p>协会对在 HCI 领域有影响力的学者,以及对本协会有重要贡献的会员发放相应的奖项。</p ><p>(1)奖项分类</p ><p>A. 华人华侨HCI领军人物</p ><p>B. 华人华侨HCI青年领军人物</p ><p>C. 名誉会员</p ><p>D. 名誉顾问 Honorary Advisory Council</p ><p>E. ICACHI贡献奖 Service Award</p ><p>F. ICACHI贡献 Honorable Mention</p ><p>G. ICACHI贡献 Special Thanks</p ><p>(2)颁奖周期</p ><p>奖项A、B、C、D，和E的颁奖周期为每两年一次。获奖人数三到五人。奖项F，和G的颁奖周期为每年一次。</p ><p>(3)提名、审核，及颁奖手续</p ><p>秘书处首先征集候选人提名，并整理候选人名单。在提名人投票不能达成共识时，由理事会进行投票表决。秘书处将根据情况整理最终候选人名单，并向理事会征集意见。理事会一致通过该名单后，秘书处将联系奖项A，B，C/D的被提名者，核实其是否接受提名，以及是否出席颁奖仪式。同时也将联系奖项E，F，G的被提名者，通知其获奖的消息，并核实其是否出席颁奖仪式。秘书处需在颁奖仪式之前完制奖状。</p >-->
<!--          <h4>第 19 条(解散)</h4><p>本会, 在理事会提出议案后,由出席会员总会中占4分之3以上有表决权者表决执行。</p >-->
<!--          <h4>第 20 条(规章的解释)</h4><p>本规章的解释权归理事会。</p >-->
<!--          <h4>第 21 条(禁止分配公积金)</h4><p>本会不能进行公积金的分配。</p >-->
<!--          <h4>第 22 条(生效)</h4><p>本规章,自通过之日(2014 年 1 月 28 日)起有效。第 13 条从第 2 期理事会产生时 开始实施。</p >-->
<!--          <h4>第 23 条 (规章修订过程)</h4><p>原案2012年5月10日 ver 1.0 表决通过 修订版2014年1月28日 ver 2.0 表决通过 修订版2015年8月30日 ver 3.0 表决通过</p >-->

          <!--          条款内容结束-->
          <div class="col-md-8 col-lg-9">
            <div id="intro" class="space-bottom-1" v-html="content"></div>

            <!-- Sticky Block End Point -->
            <div id="stickyBlockEndPoint"></div>
          </div>
        </div>
      </div>
      <!-- End Terms Content Section -->
    </main>
    <!-- ========== END MAIN ========== -->
  </div>
</template>
<style>
.is_fixed{
  width: 100%;
  position: fixed;
  top: 65px;
  z-index: 999;
}
</style>
<script>
export default {
  data () {
    return {
      isFixed: false,
      offsetTop: 0,
      heroTitle: "bylaws.Bylaws",
      heroSubTitle: '',
      content:'',
    }
  },
  created () {
    this.getLaws();
  },
  mounted() {
    window.addEventListener('scroll', this.initHeight);
    this.$nextTick(() => {
      //获取对象相对于版面或由 offsetTop 属性指定的父坐标的计算顶端位置
      this.offsetTop = document.querySelector('#boxFixed').offsetTop;
    })
  },
//回调中移除监听
  destroyed() {
    window.removeEventListener('scroll', this.handleScroll)
  },
  methods: {
    /********* start-目录吸顶********/
    initHeight() {
// 设置或获取位于对象最顶端和窗口中可见内容的最顶端之间的距离 (被卷曲的高度)
      var scrollTop = window.pageYOffset || document.documentElement.scrollTop || document.body.scrollTop
//如果被卷曲的高度大于吸顶元素到顶端位置 的距离
      this.isFixed = scrollTop > this.offsetTop ? true : false;
    },
    /********* end-目录吸顶********/
    getLaws () {
      //console.log(this.MainNewsTitle)
      this.$axios.get('/public/law')
        .then(res => {
          console.log(res.data.data[0])
          var data = res.data.data[0]
          this.content = data.chapterContent



        })
        .catch(err => {
          console.error(err)
        })
    },
    mounted () {
      // INITIALIZATION OF STICKY BLOCKS
      // =======================================================
      $('.js-sticky-block').each(function () {
        var stickyBlock = new HSStickyBlock($(this)).init();
      });

      // INITIALIZATION OF STICKY BLOCK
      // =======================================================
      var cbpStickyFilter = new HSStickyBlock($('#cbpStickyFilter'))

      // INITIALIZATION OF SCROLL NAV
      // =======================================================
      $('.js-scroll-nav').each(function () {
        var scrollNav = new HSScrollNav($(this)).init();
      })
    }
  }
}
</script>
